app/Controllers/admin/transaksi.php

SELECT *
FROM `tbl_anggota`
SELECT *
FROM `tbl_buku`
SELECT *
FROM `tbl_denda`
---
    public function tambah()
    {
        $data = [
            'anggota' => $this->anggota->findAll(),
            'buku' => $this->buku->findAll(),
            'denda' => $this->denda->findAll(), // Ambil semua denda dari tabel denda
        ];

INSERT INTO `tbl_transaksi` (`id_anggota`, `tanggal_peminjaman`, `tanggal_pengembalian`, `id_denda`) VALUES ('9', '2024-05-29', '2024-06-01', '12')
INSERT INTO `tbl_detail_transaksi` (`id_transaksi`, `id_buku`) VALUES (38, '18')
---
    public function simpan()
    {
        // Tangkap data dari formulir
        $id_anggota = $this->request->getPost('id_anggota');
        $tanggal_peminjaman = $this->request->getPost('tanggal_peminjaman');
        $tanggal_pengembalian = $this->request->getPost('tanggal_pengembalian');
        $id_buku_list = $this->request->getPost('id_buku'); // Array of book IDs
        $id_denda = $this->request->getPost('id_denda'); // ID denda yang dipilih

        // Simpan data transaksi
        $this->transaksi->save([
            'id_anggota' => $id_anggota,
            'tanggal_peminjaman' => $tanggal_peminjaman,
            'tanggal_pengembalian' => $tanggal_pengembalian,
            'id_denda' => $id_denda // Simpan ID denda
        ]);

        $id_transaksi = $this->transaksi->insertID();

        // Simpan detail transaksi
        foreach ($id_buku_list as $id_buku) {
            $this->detailTransaksi->save([
                'id_transaksi' => $id_transaksi,
                'id_buku' => $id_buku,
            ]);

SELECT *
FROM `tbl_transaksi`
WHERE `tbl_transaksi`.`id_transaksi` = '38'
SELECT *
FROM `tbl_detail_transaksi`
WHERE `id_transaksi` = '38'
SELECT *
FROM `tbl_denda`
WHERE `tbl_denda`.`id_denda` = '12'
INSERT INTO `tbl_histori_transaksi` (`id_anggota`, `tanggal_peminjaman`, `tanggal_pengembalian`, `tanggal_dikembalikan`, `telat`, `denda`) VALUES ('9', '2024-05-29', '2024-06-01', '2024-06-05', 4, 80000)
INSERT INTO `tbl_histori_detail_transaksi` (`id_histori_transaksi`, `id_buku`) VALUES (30, '18')
DELETE FROM `tbl_transaksi`
WHERE `id_transaksi` IN ('38')
DELETE FROM `tbl_detail_transaksi`
WHERE `id_transaksi` = '38'
---
    public function selesai($id_transaksi)
    {
        $transaksi = $this->transaksi->find($id_transaksi);
        if ($transaksi) {
            $detailTransaksi = $this->detailTransaksi->where('id_transaksi', $id_transaksi)->findAll();

            $tanggal_dikembalikan = date('Y-m-d'); // Atau ambil dari input form jika diperlukan
            $telat = (strtotime($tanggal_dikembalikan) > strtotime($transaksi['tanggal_pengembalian'])) ? (strtotime($tanggal_dikembalikan) - strtotime($transaksi['tanggal_pengembalian'])) / (60 * 60 * 24) : 0;

            // Ambil tarif denda dari tabel denda
            $denda = 0;
            $tarif_denda = $this->denda->find($transaksi['id_denda']);
            if ($tarif_denda) {
                $denda = $telat * $tarif_denda['denda']; // Hitung total denda
            }

            // Simpan data ke tabel histori_transaksi
            $this->historiTransaksi->save([
                'id_anggota' => $transaksi['id_anggota'],
                'tanggal_peminjaman' => $transaksi['tanggal_peminjaman'],
                'tanggal_pengembalian' => $transaksi['tanggal_pengembalian'],
                'tanggal_dikembalikan' => $tanggal_dikembalikan,
                'telat' => $telat,
                'denda' => $denda, // Simpan nilai denda
            ]);

            $id_histori_transaksi = $this->historiTransaksi->insertID();

            // Simpan detail transaksi yang selesai ke histori detail transaksi
            foreach ($detailTransaksi as $detail) {
                $this->historiDetailTransaksi->save([
                    'id_histori_transaksi' => $id_histori_transaksi,
                    'id_buku' => $detail['id_buku'],
                    // Tambahkan kolom lain sesuai kebutuhan
                ]);
            }

            // Hapus data dari tabel transaksi
            $this->transaksi->delete($id_transaksi);

            // Hapus detail transaksi terkait
            $this->detailTransaksi->where('id_transaksi', $id_transaksi)->delete();