app/Models/historiTransaksiModels.php

    public function getHistoriTransaksiWithDetails($id_histori_transaksi = null)
    {
        $builder = $this->db->table($this->table)
            ->select('tbl_histori_transaksi.*, tbl_anggota.nama_anggota')
            ->join('tbl_anggota', 'tbl_anggota.id_anggota = tbl_histori_transaksi.id_anggota');

        if ($id_histori_transaksi !== null) {
            $builder->where('tbl_histori_transaksi.id_histori_transaksi', $id_histori_transaksi);
        }
        $query = $builder->get();
---
SELECT `tbl_histori_transaksi`.*, `tbl_anggota`.`nama_anggota`
FROM `tbl_histori_transaksi`
JOIN `tbl_anggota` ON `tbl_anggota`.`id_anggota` = `tbl_histori_transaksi`.`id_anggota`
WHERE `tbl_histori_transaksi`.`id_histori_transaksi` = 'img'