app/Models/historiDetailTransaksiModels.php

SELECT `tbl_buku`.`judul`, `tbl_histori_transaksi`.`tanggal_peminjaman`, `tbl_histori_transaksi`.`tanggal_pengembalian`, `tbl_histori_transaksi`.`tanggal_dikembalikan`, `tbl_histori_transaksi`.`telat`, `tbl_histori_transaksi`.`denda`
FROM `tbl_histori_detail_transaksi`
JOIN `tbl_buku` ON `tbl_buku`.`id_buku` = `tbl_histori_detail_transaksi`.`id_buku`
JOIN `tbl_histori_transaksi` ON `tbl_histori_transaksi`.`id_histori_transaksi` = `tbl_histori_detail_transaksi`.`id_histori_transaksi`
WHERE `tbl_histori_detail_transaksi`.`id_histori_transaksi` = 'img'
---
    public function getDetailByHistoriTransaksi($id_histori_transaksi)
    {
        $query = $this->db->table($this->table)
            ->select('tbl_buku.judul, tbl_histori_transaksi.tanggal_peminjaman, tbl_histori_transaksi.tanggal_pengembalian, tbl_histori_transaksi.tanggal_dikembalikan, tbl_histori_transaksi.telat, tbl_histori_transaksi.denda,')
            ->join('tbl_buku', 'tbl_buku.id_buku = tbl_histori_detail_transaksi.id_buku')
            ->join('tbl_histori_transaksi', 'tbl_histori_transaksi.id_histori_transaksi = tbl_histori_detail_transaksi.id_histori_transaksi')
            ->where('tbl_histori_detail_transaksi.id_histori_transaksi', $id_histori_transaksi)
            ->get();