app/Models/transaksiModels.php

SELECT `tbl_transaksi`.*, `tbl_anggota`.`nama_anggota`, `tbl_denda`.`denda`
FROM `tbl_transaksi`
JOIN `tbl_anggota` ON `tbl_anggota`.`id_anggota` = `tbl_transaksi`.`id_anggota`
JOIN `tbl_denda` ON `tbl_denda`.`id_denda` = `tbl_transaksi`.`id_denda`
WHERE `tbl_transaksi`.`id_transaksi` = '37'
GROUP BY `tbl_transaksi`.`id_transaksi`
---
    public function getTransaksiWithDetails($id_transaksi = null)
    {
        $builder = $this->db->table('tbl_transaksi');
        $builder->select('tbl_transaksi.*, tbl_anggota.nama_anggota, tbl_denda.denda')
            ->join('tbl_anggota', 'tbl_anggota.id_anggota = tbl_transaksi.id_anggota')
            ->join('tbl_denda', 'tbl_denda.id_denda = tbl_transaksi.id_denda')
            ->groupBy('tbl_transaksi.id_transaksi');

        if ($id_transaksi !== null) {
            $builder->where('tbl_transaksi.id_transaksi', $id_transaksi);
        }

        $query = $builder->get();

SELECT `tbl_buku`.`judul`, `tbl_transaksi`.`tanggal_peminjaman`, `tbl_transaksi`.`tanggal_pengembalian`
FROM `tbl_detail_transaksi`
JOIN `tbl_transaksi` ON `tbl_transaksi`.`id_transaksi` = `tbl_detail_transaksi`.`id_transaksi`
JOIN `tbl_buku` ON `tbl_buku`.`id_buku` = `tbl_detail_transaksi`.`id_buku`
WHERE `tbl_detail_transaksi`.`id_transaksi` = '37'
---
    public function getDetailByTransaksi($id_transaksi)
    {
        return $this->db->table('tbl_detail_transaksi')
            ->select('tbl_buku.judul, tbl_transaksi.tanggal_peminjaman, tbl_transaksi.tanggal_pengembalian')
            ->join('tbl_transaksi', 'tbl_transaksi.id_transaksi = tbl_detail_transaksi.id_transaksi')
            ->join('tbl_buku', 'tbl_buku.id_buku = tbl_detail_transaksi.id_buku')
            ->where('tbl_detail_transaksi.id_transaksi', $id_transaksi)
            ->get()
            ->getResult();